<?php

namespace Perk11\Viktor89;

use Perk11\Viktor89\IPC\ProgressUpdateCallback;

class PrintHelpProcessor implements MessageChainProcessor
{
    private const COMMANDS = [
        '/image' => 'Генераций изображения. Текст после команды будет использован в качестве запроса, например <code>/image a cute cat curling in a ball</code>.',
        '/imagine' => 'Аналог /image, но текст вашего запроса будет отправлен LLM для улучшения и перевода на английский. Поддерживает большинство языков.',
        '/rmbg' => 'Удаление фона изображения.',
        '/imagemodel' => 'Выбор модели для генерации изображения',
        '/e' =>  'Редактирование изображения. Текст после команды будет использован в качестве запроса. Используйте в ответ на фото или файл.',
        '/edit' => 'Тоже что e, но запрос пройдёт через LLM.',
        '/editmodel' => 'Выбор модели для /e и /edit',
        '/imagesize' => 'Размер изображения. Не все модели одинаково хорошо справляются с разными размерами',
        '/steps' => 'Количество шагов для генерации изображения или видео, например <code>/steps 20</code>. Чем больше шагов, тем дольше занимает генерация. Каждой модели нужно своё количество шагов. Не рекомендуется менять без понимания особенностей модели. Чтобы сбросить значение отправьте <code>/steps</code> без параметров',
        '/upscale' => 'Улучшить качество фото с использование нейросети. Используйте в ответ на фото.',
        '/downscale' => 'Ухудшить качество фото. Используйте в ответ на фото.',
        '/video' => 'Генерация видео. Текст после команды будет использован в качестве запроса. Например: <code>/video A spaceship landing on Venus</code>. Если команда использует в ответ на фото, то фото будет использоваться в качестве первого кадра для видео. Поддерживается только английский язык. Занимает от 8 до 20 минут.',
        '/vid' => 'Аналог /video, но текст вашего запроса будет отправлен LLM для улучшения и перевода на английский. Первый кадр будет сгенерирован с помощью flux для улучшения качества. Поддерживает большинство языков.',
        '/vo' => 'Создать видео на основе аудио и изображения.',
        '/videomodel' => 'Выбор модели для генерации видео.',
        '/img2videomodel' => 'Выбор модели для /vid, /video когда они используются в ответ на фото, и для /vo',
        '/seed' => 'Первичное значение для псевдослучайного генератора. Работает для /image и /video Например: <code>/seed 123</code>. Отправьте /seed без параметров, чтобы сбросить на случайное значение.',
        '/say' => 'Текст после команды будет использован для генерации речи. Например: <code>/say Я Виктор89!</code>',
        '/saymodel' => 'Выбор модели и голоса для say',
        '/podcast' => 'создание аудио-диалога между двумя собеседниками',
        '/transcribe' => 'Распознавание речи. Ответьте на голосовое сообщение, кружок, видео, или аудио чтобы распознать его.',
        '/clownon' => '<span class="tg-spoiler">Включить секретный режим клоуна.</span>',
        '/clownify' => 'Использовать в ответ на фото с человеческим лицом.',
        '/preferences' => 'Показать ваши настройки.',
        '/assistant' => 'Начать общение с LLM. Например: <code>/assistant Привет</code>. Чтобы продолжить общение, отвечайте на сообщения бота.',
        '/assistantmodel' => 'Выбор модели LLM.',
        '/systemprompt' => 'Указание для LLM о том что он должен делать. Например: <code>/systemprompt You are a heartless and mean robot</code>. Значение по умолчанию: <code>Always respond to the user in the language they use or request.</code>. Отправьте /systemprompt без параметров, чтобы сбросить на значение по умолчанию.',
    ];

    public function processMessageChain(MessageChain $messageChain, ProgressUpdateCallback $progressUpdateCallback): ProcessingResult
    {
        $message = InternalMessage::asResponseTo($messageChain->last());
        $message->messageText = "Привет, я Виктор89.\n
Пожалуйста не используйте меня для генерации чего-либо незаконного, а так же не пытайтесь меня перегрузить.\n
<b><u>Доступные команды</u></b>\n";
        $message->parseMode = 'HTML';
        foreach (self::COMMANDS as $command => $description) {
            if (mb_strlen($message->messageText) + mb_strlen($description) >= 4000) {
                $message->send();
                $message = InternalMessage::asResponseTo($messageChain->last(), '');
                $message->parseMode = 'HTML';
            }
            $message->messageText .= "<b>" . htmlentities($command) . "</b> $description\n\n";
        }

        $message->messageText .= htmlspecialchars('Все команды использующие нейросеть выполняются по очереди, а значит бот может не сразу приступить к исполнению вашего задания. Если бот поставил реакцию "👀", значит запрос получен.');
        $message->send();
        return new ProcessingResult(null, true);
    }
}
